history/app/controllers/cancellors_controller.rb

SELECT "cancellors".* FROM "cancellors"
---
  def index
    @cancellors = Cancellor.all

UPDATE "cancellors" SET "first_name" = ?, "updated_at" = ? WHERE "cancellors"."id" = ?  [["first_name", "Ludwig, \"luddi\""], ["updated_at", "2015-11-01 15:36:07.032115"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @cancellor.update(cancellor_params)

SELECT  "cancellors".* FROM "cancellors" WHERE "cancellors"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_cancellor
      @cancellor = Cancellor.find(params[:id])